Revit 2024 API
DataConversionMonitorScope Members
The DataConversionMonitorScope type exposes the following members.
Constructors
Name | Description
DataConversionMonitorScope
 The only constructor. Expects a valid pointer to IDataConversionMonitor.
Methods
Name | Description
Dispose
Releases all resources used by the DataConversionMonitorScope
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DataConversionMonitorScope Class
Autodesk.Revit.DB Namespace